{
  "tasks": [
    {
      "id": "1",
      "title": "Проектная инфраструктура и базовая структура",
      "description": "Настройка базовой структуры проекта, включая создание папок, HTML основы и начальную конфигурацию.",
      "status": "done",
      "priority": "high",
      "dependencies": [],
      "testStrategy": "Проверка корректного создания файловой структуры и успешного открытия index.html в браузере.",
      "details": "Создать основную структуру проекта с папками css/, js/, data/, настроить index.html как SPA, подготовить базовую разметку и навигацию."
    },
    {
      "id": "2", 
      "title": "Парсер CSV и управление наборами карточек",
      "description": "Разработка функционала для загрузки и парсинга CSV файлов с наборами карточек.",
      "status": "done",
      "priority": "high",
      "dependencies": ["1"],
      "testStrategy": "Unit тесты для парсера CSV, тестирование с различными форматами файлов.",
      "details": "Реализовать асинхронную загрузку CSV файлов, парсинг с поддержкой кавычек и разделителей, валидацию формата данных, обработку ошибок."
    },
    {
      "id": "3",
      "title": "Алгоритм Spaced Repetition (SM-2)",
      "description": "Реализация алгоритма интервальных повторений SM-2 для планирования карточек.",
      "status": "done", 
      "priority": "high",
      "dependencies": [],
      "testStrategy": "Unit тесты алгоритма с различными сценариями ответов, проверка корректности вычисления интервалов.",
      "details": "Имплементировать алгоритм SM-2, включая расчет ease factor, интервалов повторения, обработку различных типов ответов (Again, Hard, Good, Easy)."
    },
    {
      "id": "4",
      "title": "Система хранения в localStorage",
      "description": "Разработка системы сохранения и загрузки прогресса пользователя в браузере.",
      "status": "done",
      "priority": "high", 
      "dependencies": ["3"],
      "testStrategy": "Тестирование сохранения/загрузки данных, проверка корректности сериализации объектов.",
      "details": "Создать схему данных для localStorage, реализовать методы сохранения прогресса карточек, версионирование схемы, обработка лимитов storage."
    },
    {
      "id": "5",
      "title": "Интерфейс выбора набора карточек",
      "description": "UI для просмотра доступных наборов карточек и выбора для изучения.",
      "status": "done",
      "priority": "medium",
      "dependencies": ["2"],
      "testStrategy": "Интеграционные тесты выбора набора, проверка отображения метаданных наборов.",
      "details": "Создать карточки наборов с превью, статистикой прогресса, поиском и фильтрацией, адаптивный дизайн для мобильных устройств."
    },
    {
      "id": "6",
      "title": "Интерфейс изучения карточек",
      "description": "Основной UI для процесса изучения: показ карточки, переворот, оценка сложности.",
      "status": "done",
      "priority": "high",
      "dependencies": ["3", "4"],
      "testStrategy": "E2E тестирование полного процесса изучения карточки, тестирование keyboard navigation.",
      "details": "Разработать компоненты для показа вопроса/ответа, кнопки оценки (Again/Hard/Good/Easy), прогресс-бар сессии, keyboard shortcuts."
    },
    {
      "id": "7", 
      "title": "Система статистики и аналитики",
      "description": "Сбор и отображение статистики изучения: сессии, общий прогресс, метрики производительности.",
      "status": "done",
      "priority": "medium",
      "dependencies": ["4", "6"],
      "testStrategy": "Проверка корректности расчета статистик, тестирование различных сценариев изучения.",
      "details": "Реализовать сбор метрик сессии, расчет общей статистики по наборам, графики прогресса, экспорт статистики."
    },
    {
      "id": "8",
      "title": "Адаптивный дизайн и UX",
      "description": "Создание responsive дизайна с поддержкой мобильных устройств и планшетов.",
      "status": "done",
      "priority": "medium", 
      "dependencies": ["5", "6"],
      "testStrategy": "Тестирование на различных размерах экранов, проверка touch controls.",
      "details": "Оптимизировать интерфейс для мобильных устройств, настроить touch gestures для переворота карточек, улучшить UX на маленьких экранах."
    },
    {
      "id": "9",
      "title": "Темная тема и настройки интерфейса",
      "description": "Реализация переключения между светлой и темной темой, настройки пользователя.",
      "status": "done",
      "priority": "low",
      "dependencies": ["8"],
      "testStrategy": "Проверка корректного переключения тем, сохранения настроек пользователя.",
      "details": "Создать CSS переменные для тем, компонент переключения темы, сохранение предпочтений в localStorage, настройки интерфейса."
    },
    {
      "id": "10",
      "title": "Улучшения доступности (a11y)",
      "description": "Реализация ARIA атрибутов, keyboard navigation, поддержка screen readers.",
      "status": "cancelled", 
      "priority": "low",
      "dependencies": ["6", "7"],
      "testStrategy": "Тестирование с screen readers, проверка keyboard navigation, аудит accessibility.",
      "details": "Добавить ARIA метки, улучшить keyboard shortcuts, обеспечить корректную навигацию для assistive technologies."
    },
    {
      "id": "11",
      "title": "Оптимизация производительности",
      "description": "Оптимизация загрузки приложения, кэширование, минификация ресурсов.",
      "status": "done",
      "priority": "medium",
      "dependencies": ["2", "6"],
      "testStrategy": "Performance тесты, проверка времени загрузки, memory usage тесты.",
      "details": "Реализовать lazy loading CSV файлов, кэширование наборов карточек, оптимизация CSS/JS bundle, Service Worker для офлайн работы."
    },
    {
      "id": "12",
      "title": "Документация и примеры наборов карточек",
      "description": "Создание README, документации по формату CSV, примеров наборов карточек.",
      "status": "done",
      "priority": "low", 
      "dependencies": ["2"],
      "testStrategy": "Проверка корректности документации, тестирование примеров наборов карточек.",
      "details": "Написать подробный README с инструкциями, документировать формат CSV файлов, создать примеры наборов для демонстрации, guide по добавлению новых наборов."
    }
  ]
} 